[
    {
        "title": "Latest Notifications",
        "vacancies": "375",
        "qualification": "Advt No Last Date More Information 26/12/2025 Latur DCC Bank Clerk, Peon and Other     – 375 Posts Any Graduate, 12TH, 10TH – 21-01-2026 Get Details 26/12/2025 Bank of Baroda MD and CEO     – 01 Posts Any Graduate, MBA/PGDM – 15-01-2026 Get Details 26/12/2025 NABARD Young Professional     – 44 Posts Any Bachelors Degree, Any Masters Degree – 12-01-2026 Get Details 26/12/2025 Bank of Baroda Vice President     – 01 Posts MBA/PGDM – 15-01-2026 Get Details 24/12/2025 Sangli Urban Co operative Bank Clerk     – Any Graduate – 05-01-2026 Get Details 24/12/2025 YDCC Bank Chief Executive Officer Any Graduate, CA – 09-01-2026 Get Details 24/12/2025 BOBCAPS AVP Investment Banking Equity Any Graduate, CA, MBA/PGDM – 15-04-2026 Get Details 24/12/2025 BOI Apprentices Trainee     – 400 Posts Any Graduate – 10-01-2026 Get Details 23/12/2025 Bank of Baroda Faculty     – 01 Posts Any Graduate – 10-01-2026 Get Details 23/12/2025 Bank of Baroda House Faculty     – 01 Posts Any Graduate – 07-01-2026 Get Details 23/12/2025 SBI Specialist Cadre Officers     – 996 Posts Any Graduate, MBA/PGDM CRPD/SCO/2025-26/17 05-01-2026 Get Details 23/12/2025 RBI Banks Medical Consultant     – 01 Posts MBBS – 22-01-2026 Get Details 23/12/2025 Bank of Baroda Financial Literacy Counsellor     – 01 Posts Any Graduate – 10-01-2026 Get Details 23/12/2025 Bank of Baroda Financial Literacy Counsellor     – 01 Posts Any Graduate – 12-01-2026 Get Details 23/12/2025 RNSB Apprentice Any Graduate – 28-12-2025 Get Details 20/12/2025 Punjab and Sind Bank BMC MBBS, MS/MD – 03-01-2026 Get Details 20/12/2025 Bank of India Credit Officer     – 514 Posts Any Graduate Project No. 2025-26/01 05-01-2026 Get Details 20/12/2025 NABARD Specialists     – 17 Posts Any Post Graduate – 02-01-2026 Get Details 17/12/2025 TNSCB Assistant     – 50 Posts Any Graduate, B.Com, B.Tech/B.E, LLB 02/2025 31-12-2025 Get Details 17/12/2025 RBI Experts     – 93 Posts B.B.A, B.Sc, B.Tech/B.E, LLB, CA, LLM, M.Sc, M.E/M.Tech, MBA/PGDM, MCA, PGDBA RBISBBA/04/2025-26 06-01-2026 Get Details 16/12/2025 Nainital Bank Advisor IT     – 01 Posts B.Tech/B.E, Diploma, MCA – 31-12-2025 Get Details 16/12/2025 Nainital Bank Clerk, PO and Other     – 185 Posts Any Graduate, Any Post Graduate – 01-01-2026 Get Details 12/12/2025 SIDBI Analyst     – 02 Posts B.Tech/B.E, CA, M.A 12/ 2025-26 30-12-2025 Get Details 04/12/2025 Bank of Baroda Business Correspondent Coordinator     – 01 Posts MBA/PGDM, MCA – 31-12-2025 Get Details 20/11/2025 BMC Bank Branch Man",
        "salary": "Not Available",
        "age_limit": "Not Available",
        "last_date": "Reminder",
        "apply_link": "https://www.freejobalert.com/latest-notifications/",
        "source": "https://www.freejobalert.com/"
    },
    {
        "title": "Upcoming Notifications",
        "vacancies": "1180",
        "qualification": "- Andhra Pradesh Post Date Exam Name More Info 17/10/2024 AP Mega DSC 2024 Notification Get Details 06/07/2024 AP Ward Sachivalayam 2024 Notification Get Details 19/04/2024 AP Inter Academic Calendar Get Details 15/02/2024 APPSC FRO Notification Get Details 02/05/2023 APPSC Information About Group 1 & 2 Notifications Get Details 02/05/2023 APPSC Various Vacancy Exam Dates Get Details 18/04/2023 AP Anganwadi Vacancy Information Get Details 01/02/2023 AP CET Exam Date Information Get Details 18/01/2023 AP Ward Sachivalayam Notification Get Details 18/01/2023 AP RBR 7384 Vacancy Information Get Details 04/10/2022 AP",
        "salary": "Not Available",
        "age_limit": "Not Available",
        "last_date": "Reminder",
        "apply_link": "https://www.freejobalert.com/upcoming-notifications/21614/",
        "source": "https://www.freejobalert.com/"
    },
    {
        "title": "Anganwadi Recruitment",
        "vacancies": "Not Available",
        "qualification": "s, online apply date, anganwadi vacancy list district wise and start your career in Integrated Child Development Services (ICDS). Download Anganwadi Form 2025 now at icds.gov.in and stay updated on Anganwadi latest recruitment notifications. Stay updated with the latest Anganwadi job notifications from all states, including Karnataka, TN, Telangana, UP, AP, Maharashtra, Bihar and more. Jharkhand 810 Home Guard Online Form 2026 Jharkhand Home Guard Online Form 2026 JKSSB 390 Various Vacancies Online Form 2026 IOCL 501 Apprentice Online Form 2026 UP Anganwadi Online Form 2026 RRB 22000 Group D Online form 2026 AIIMS Raipur Senior Resident Online Form 2025 Latur DCC Bank 375 Clerk, Peon and Driver Online Form 2025 JKSSB 1815 Constable Online Form 2026 WWW.FREEJOBALERT.COM Anganwadi Jobs Recruitment Board Exam / Post Name Last Date More Information UP Anganwadi Anganwadi Helper 2026-01-08 Get Details UP Anganwadi Anganwadi Workers 2026-01-04 Get Details WCD Odisha Anganwadi Helper 2026-01-06 Get Details WCD Odisha Anganwadi Helper 2026-01-01 Get Details WCD Ananthapuramu Anganwadi Worker and Helper 2025-12-31 Get Details WCD Odisha Anganwadi Helper 2026-01-04 Get Details WCD AP Anganwadi Worker and Helper 2025-12-30 Get Details WCD Odisha Anganwadi Helper 2025-12-30 Get Details WCD Odisha Anganwadi Helper 2025-12-31 Get Details WCD Odisha Anganwadi Worker 2026-01-07 Get Details WCD Tumkur Anganwadi Worker and Helper 2026-01-09 Get Details WCD Odisha Anganwadi Helper 2026-01-16 Get Details WCD Anganwadi Recruitment 2025 Apply Online wcd.nic.in Anganwadi Recruitment 2025: Get the latest Anganwadi vacancies for Anganwadi Workers, Anganwadi Helpers, and Supervisors. Check eligibility, application form details, qualifications, online apply date, anganwadi vacancy list district wise and start your career in Integrated Child Development Services (ICDS). Download Anganwadi Form 2025 now at icds.gov.in and stay updated on Anganwadi latest recruitment notifications. Stay updated with the latest Anganwadi job notifications from all states, including Karnataka, TN, Telangana, UP, AP, Maharashtra, Bihar and more Anganwadi Recruitment 2025 - Overview Category Details Recruitment Name Anganwadi Recruitment 2025 Conducted By State Governments under ICDS Scheme Available Posts Anganwadi Worker, Helper, Mini Worker, Supervisor Educational Qualification Worker/Mini Worker: 10th Pass Helper: 8th Pass Supervisor: Graduate",
        "salary": "Not Available",
        "age_limit": "18 to 35/40 years (varies by state) Application Mode Offline / Online (state-wise) Selection Process Merit-based on academic marks, document verification, interview Required Documents Educational Certificates, ID Proof, Address Proof, Photo, Caste Certificate Who Can Apply for Anganwadi Job Vacancy 2025? The Ministry of Women and Child Development (WCD) has defined clear eligibility criteria for candidates who wish to apply for various Anganwadi posts across India. These guidelines ensure that suitable and qualified individuals are selected for the welfare and development of children and women at the grassroots level Gender : Both male and female candidates are eligible to apply for Anganwadi job roles Age Limit: Applicants must be at least 18 years old and not older than 40 years (age relaxation may apply as per government norms) Educational Qualification: Minimum Qualification: 10th pass from a recognized board Higher Posts: Candidates applying for Supervisor or Officer-level posts should have a graduate degree or qualifications relevant to the post Residential Status: The applicant must be a permanent resident of the respective state/district where the vacancy is announced Language Proficiency: Must be able to read, write, and speak the local language of the region where applying Documents Required for Anganwadi Application Make sure to keep the following documents ready at the time of application: Document Purpose Aadhar Card Identity verification Domicile Certificate Proof of residence in the respective state or district Caste Certificate To claim reservation benefits (if applicable) Educational Certificates Proof of academic qualifications Passport Size Photo For use in application form Mobile Number For communication and updates Email ID To receive official communication (if required) Signature For form submission and verification Anganwadi Selection Process 2025 The selection process for Anganwadi jobs is mostly merit-based and conducted by the respective State Women and Child Development (WCD) departments. Here's how it works Application Submission: Candidates need to fill and submit the Anganwadi application form along with all required documents before the deadline, either online or offline as per their state Document Verification: After applications are received, officials verify the submitted documents like educational certificates, identity proof, domicile certificate, and caste certificate (if applicable) Merit List Preparation: Based on the marks obtained in 8th, 10th, or 12th standard (depending on the post), a merit list is prepared. No written examination is usually conducted for Worker and Helper posts Interview (if applicable): Some states may conduct a short interview for final verification or for supervisor-level posts Final Selection: The final list of selected candidates is published on the district’s official WCD website or notice board. Selected candidates may also receive a call or SMS regarding joining formalities. Notifications Latest Notifications Employment News Search Jobs Sarkari Job Sarkari Naukri Anganwadi Recruitment Work From Home Jobs Part Time Jobs Sports Quota Jobs Ex-Servicemen Jobs PWD Jobs EDUCATION Free Mock Test Latest Announcements Sarkari Result Admit Card Exam Results Answer Key Cutoff Marks Written Marks Interview Results",
        "last_date": "Reminder",
        "apply_link": "https://www.freejobalert.com/anganwadi-recruitment/",
        "source": "https://www.freejobalert.com/"
    },
    {
        "title": "Bombay High Court Recruitment 2025 [2381 Post] Apply Online",
        "vacancies": "2381",
        "qualification": "s ranging from 10th pass to any graduate degree can apply online through the official website bombayhighcourt.nic.in. The online application process starts on 15th December 2025 and will remain open until 5th January 2026. This recruitment drive offers excellent government job opportunities in Maharashtra with attractive salaries up to ₹1,77,500 per month, making it a significant opportunity for aspirants seeking Bombay High Court jobs in 2025. Trending Govt Jobs RRB 22000 Group D Online form 2026 DSSSB TGT Exam Date 2026 BARC Scientific Officers Online Form 2026 SBI 996 SCO Online Form 2025 BSF Constable GD Online Form 2025-26 Bombay High Court Clerk, Peon and More Recruitment 2025 Overview Advertisement The Bombay High Court has released a notification for 2381 vacancies for Clerk, Peon, Driver, and Stenographer (Lower & Higher) posts, with online applications open from 15-12-2025 to 05-01-2026 through the official website bombayhighcourt.nic.in. Candidates with 10th pass or any graduate degree can apply, with an",
        "salary": "range from Rs. 16,600 to Rs. 1,77,500 (post-wise pay scales as per rules). Company Name Bombay High Court Post Name Clerk, Peon and More No of Posts 2381 Salary Rs.16,600-1,77,500 Qualification Any Graduate, 10TH",
        "age_limit": "of 18 to 38 years and a salary range from Rs. 16,600 to Rs. 1,77,500 (post-wise pay scales as per rules). Company Name Bombay High Court Post Name Clerk, Peon and More No of Posts 2381 Salary Rs.16,600-1,77,500 Qualification Any Graduate, 10TH Age Limit 18 to 38 years Start Date for Apply Online 15-12-2025",
        "last_date": "Reminder",
        "apply_link": "https://www.freejobalert.com/articles/bombay-high-court-recruitment-2025-apply-online-for-2381-clerk-peon-and-more-posts-3032338",
        "source": "https://www.freejobalert.com/"
    }
]